#!/usr/bin/env python3
# Copyright 2019 Nihon Unisys, Ltd.
#
# This source code is licensed under the BSD license. 

PERSON = ["ふりがな","両親","作品","別名","参加イベント","受賞歴","国籍","学歴","家族","居住地","師匠","所属組織","時代","本名","死因","没地","没年月日","生年月日","生誕地","称号","職業","異表記"]
COMPOUND = ["読み","別称","用途","種類","商標名","特性","原材料","製造方法","生成化合物","CAS番号","化学式","密度","融点","沸点","示性式"]
AIRPORT = ["ふりがな","IATA（空港コード）","ICAO（空港コード）","別名","名前の謂れ","名称由来人物の地位職業名","国","年間利用客数","年間利用者数データの年","年間発着回数","年間発着回数データの年","座標・経度","座標・緯度","所在地","旧称","標高","母都市","滑走路数","滑走路の長さ","総面積","近隣空港","運営者","運用時間","開港年"]
CITY = ["ふりがな","人口","人口密度","人口データの年","別名","友好市区町村","合併市区町村","国","国内位置","地名の謂れ","座標・経度","座標・緯度","恒例行事","成立年","所在地","旧称","温泉・鉱泉","特産品","産業","種類","地形","施設","観光地","鉄道会社","面積","首長"]
COMPANY = ["正式名称","ふりがな","別名","種類","本拠地国","本拠地","設立年","業界","事業内容","取扱商品","代表者","資本金","資本金データの年","従業員数（単体）","従業員数（単体）データの年","従業員数（連結）","従業員数（連結）データの年","売上高（単体）","売上高データの年","売上高（連結）","売上高（連結）データの年","主要株主","子会社・合弁会社","業界内地位・規模","買収・合併した会社","起源","過去の社名","創業国","創業地","創業者","創業時の事業","社名使用開始年","コーポレートスローガン","商品名","解散年"]

#attrs = {"人名":PERSON, "化合物名":COMPOUND, "市区町村名":CITY, "企業名":COMPANY, "空港名":AIRPORT}
attrs = {"1.1":PERSON, "1.10.2":COMPOUND, "1.5.1.1":CITY, "1.4.6.2":COMPANY, "1.6.5.3":AIRPORT}

PERSON_TOP1KEYS=["ふりがな","国籍","没地","没年月日","生年月日","生誕地","時代"]
COMPOUND_TOP1KEYS=["ふりがな","示性式","CAS番号"]
AIRPORT_TOP1KEYS=["ふりがな","IATA（空港コード）","ICAO（空港コード）","国","標高","母都市","滑走路の長さ","年間利用客数","年間利用者数データの年","年間発着回数","年間発着回数データの年","運営者","開港年","名前の謂れ","滑走路数","総面積"]#,"座標・経度","座標・緯度"
CITY_TOP1KEYS=["ふりがな","人口","人口密度","種類","面積","人口データの年","成立年","首長","地名の由来","名称由来人物の地位職業名","国内位置"]#"座標・経度","座標・緯度",
COMPANY_TOP1KEYS=["ふりがな","別名","種類","本拠地国","本拠地","設立年","業界","代表者","資本金","資本金データの年","従業員数（単体）","従業員数（単体）データの年","従業員数（連結）","従業員数（連結）データの年","売上高（単体）","売上高データの年","売上高（連結）","売上高（連結）データの年","業界内地位・規模","起源","創業国","創業地","創業者","創業時の事業","社名使用開始年","コーポレートスローガン"]

#top1keys = {"人名": PERSON_TOP1KEYS, "化合物名": COMPOUND_TOP1KEYS, "市区町村名": CITY_TOP1KEYS, "企業名":COMPANY_TOP1KEYS, "空港名":AIRPORT_TOP1KEYS}
top1keys = {"1.1": PERSON_TOP1KEYS, "1.10.2": COMPOUND_TOP1KEYS, "1.5.1.1": CITY_TOP1KEYS, "1.4.6.2":COMPANY_TOP1KEYS, "1.6.5.3":AIRPORT_TOP1KEYS}
